%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% initset_other.m 他エリアモデルにおける発電機の初期設定
% 【このプログラムで実施すること】
%　・他エリア発電プラントモデルの初期値設定
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% 他エリア発電機モデル初期値設定　

 PLM_B = 0.03;       % GF量の設定
 %他エリア全系でGF運転機が60%程度と想定して設定
 DELTA_B = 0.067;    % 他エリア発電機の調定率の設定
 %EDC指令値を初期値に設定
 MW0_ST_OA(1) = 1.0; % 初期出力の設定
 
 %% 定数設定：他エリア汽力プラントモデル
% 1: 石油 250MW（定圧ドラム）
% 2: 石油 700MW（変圧貫流）
% 3: 石炭 700MW（変圧貫流）
% 4: 石炭1000MW（変圧貫流）
% 5: LNG  200MW（定圧ドラム）
% 6: LNG  700MW（変圧貫流）
 TY_ST = [ 6 ];                      % LNG 変圧貫流相当とする(但し変圧特性は模擬しない)
 
% 他エリアの発電機プラント定数の設定(iniset_thermalsで定義した変数から設定) 
 T1_B_ST_OA   = T1_b_st_ty(TY_ST);   % ボイラ発生蒸気時定数[s]
 T2_B_ST_OA   = T2_b_st_ty(TY_ST);   % ボイラ特性時定数[s]
 T3_B_ST_OA   = T3_b_st_ty(TY_ST);   % 圧力制御時定数[s]
 K_PREF_ST_OA = K_pref_st_ty(TY_ST); % 負荷設定比例ゲイン
 T_PREF_ST_OA = T_pref_st_ty(TY_ST); % 負荷設定積分時定数[s]
 R_LL_ST_OA   = R_ll_st_ty(TY_ST);   % 負荷制限変化率[pu/min]
 T_LL_ST_OA   = T_ll_st_ty(TY_ST);   % 負荷制限時定数[s]
 K_G_ST_OA    = K_g_st_ty(TY_ST);    % 高圧出力分担率
 T1_G_ST_OA   = T1_g_st_ty(TY_ST);   % スピードリレー時定数[pu]
 T2_G_ST_OA   = T2_g_st_ty(TY_ST);   % 蒸気加減弁サーボ時定数[s]
 T4_G_ST_OA   = T4_g_st_ty(TY_ST);   % 高圧タービン時定数[s]
 T5_G_ST_OA   = T5_g_st_ty(TY_ST);   % 低圧タービン・再熱器時定数[s]
 G_G_ST_OA    = G_g_st_ty(TY_ST);    % スピードリレー進み時定数[s]

% 主蒸気圧力の変圧特性は模擬しない（多種のプラント一括模擬のため）
 FX_FB_ST_OA   = Fx_fb_st_ty(:,TY_ST);    % 周波数偏差[Hz]
 FY_FB_ST_OA   = [1;1;0;0;-1;-1]*PLM_B;   % MWD補正値（=周波数バイアス）[pu]
 FX_PTHD_ST_OA = Fx_pthd_st_ty(:,TY_ST);     % ST出力[pu]
 FY_PTHD_ST_OA = [1;1;1;1];                  % 主蒸気圧力[pu]
