%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% iniset_lfc.m LFCモデル(LFC計算)における初期設定
% 【このプログラムで実施すること】
%　・LFCの計算条件の設定
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

%% 自動給電発電機の対象数の定義
 AGCNum_L = 30;  % Simulink上でのLFC信号の端子数を定義

%% LFC計算における共通設定
 LFC_cycle = 5.0;          %LFC制御周期(s)

%% 自エリアのLFC計算に関する初期設定
 K_A = 0.1;                %系統定数[%MW/Hz]
 AL_A = 0.3;               %平滑化係数α
 XAR_A = 10.0;             %AR不感帯[MW]・・・TBCの時に使用
 KP_A = 1.0;               %比例ゲイン
 KI_A = 0.003;             %積分ゲイン
 RA_A = G_speed';          %出力変化速度[MW/m]
 XF_A = 0.00;              %ΔF不感帯[Hz]・・・FFCの時に使用

 
%% 他エリアのLFC計算に関する初期設定
 K_B = 0.1;                %系統定数[%MW/Hz]
 AL_B = 0.3;               %平滑化係数
 XAR_B = 10.0;             %AR不感帯[MW]・・・TBCの時に使用
 KP_B = 1.0;               %比例ゲイン
 KI_B = 0.003;            %積分ゲイン
 RA_B = 96.0;              %出力変化速度[MW/m]
 PMAX_B = 360.0;           %LFC上限値[MW]
 PMIN_B = -360.0;          %LFC下限値[MW]
 XF_B = 0.00;              %ΔF不感帯[Hz]・・・FFCの時に使用
